{
    "architectures": [
      "BertForSequenceClassification"
    ],
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "finetuning_task": "cola",
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "layer_norm_eps": 1e-12,
    "max_position_embeddings": 512,
    "model_type": "bert",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "pad_token_id": 0,
    "position_embedding_type": "absolute",
    "problem_type": "single_label_classification",
    "transformers_version": "4.23.0.dev0",
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 30522,
    "PrecisionFlag": 1,     
    "use_bfp": true,
    "use_flex_bfp": false,
    "use_multi_exp": false,
    "group_size": 1,
    "bfp_M_Bit": 4,
    "thread_num": 16,
    "is_fast": false,
    "f_st": false,
    "a_st": true,
    "w_st": true,
    "threshold": 1e+6,
    "f_thres": false,
    "a_thres": false,
    "w_thres": false
  }