{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "finetuning_task": "cola",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "type_vocab_size": 1,
  "vocab_size": 50265,   
  "num_labels": 2,  
  "problem_type": "single_label_classification",
  "PrecisionFlag": 1,     
  "use_bfp": false,
  "use_flex_bfp": false,
  "use_multi_exp": false,
  "group_size": 16,
  "bfp_M_Bit": 8,
  "thread_num": 16,
  "is_fast": false,
  "f_st": true,
  "a_st": true,
  "w_st": true,
  "threshold": 1e+6,
  "f_thres": false,
  "a_thres": false,
  "w_thres": false
}